Revit 2026 API

# BuiltInFailuresDuctFailures Class

---

Failures about Duct.

SystemObject Autodesk.Revit.DBBuiltInFailuresDuctFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DuctFailures
```
```vb
Public NotInheritable Class DuctFailures
```
```cpp
public ref class DuctFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DuctFailures = class end
```

The BuiltInFailuresDuctFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateGeometryForDuct | Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together. |
|  | FlexDuctLengthOutOfLimits | The flex duct length of [Length Value] exceeds the maximum specified length of [Maximum Flex Duct Length Value] |
|  | NoDuctFittingsInProject | There are no duct fittings defined in project. The default duct type for fittings will be set to none. |
|  | PartNotFoundDueToNoDuctConnectedError | "In order to find a matching part, the fitting has to be connected to a duct." |
|  | PartNotFoundDueToNoDuctConnectedWarning | "In order to find a matching part, the fitting has to be connected to a duct." |

#### Reference

Autodesk.Revit.DB Namespace